Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: echo round( 3.4); / / 3 echo round(3.5); / / 4 echo round(3.6); / / 4 echo round(3.6, 0); / / 4 echo round(1.95583, 2); / / 1.96 echo round(1241757, -3); / / 1242000
es: $foo = round( 3.4); / / $foo == 3.0 $foo = round (3.5); / / $foo == 4.0 $foo = round (3.6); / / $foo == 4.0

source: See also ceil() and floor().
es: Vea también ceil() y floor().

source: $fruits = array ("lemon", "orange", "banana", "apple"); rsort ($fruits); reset ($fruits); while (list ($key, $val) = each ($fruits)) {echo "$key = $val\n";}
es: Esta función ordena una matriz en orden inverso (mayor a menor).

source: 0 = orange 1 = lemon 2 = banana 3 = apple
es: Ejemplo de rsort()

source: See also arsort(), asort(), ksort(), sort(), and usort().
es: Vea también: arsort(), asort(), ksort(), sort(), y usort().

source: Without the second parameter, rtrim() will strip these characters:
es: Devuelve la cadena argumento sin espacios en blanco ni saltos de línea al final.

# " " (ASCII 9 (0x09)), a tab.
source: "\t" (ASCII 9 (0x09)), a tab.
es: Es un alias para chop().

# "" (ASCII 13 (0x0D)), a carriage return.
source: "\r" (ASCII 13 (0x0D)), a carriage return.
es: Ejemplo 1.

source: "\x0B" (ASCII 11 (0x0B)), a vertical tab.
es: Ejemplo de rtrim()

source: Simply list all characters that you want to be stripped.
es: $recortada = rtrim ($linea);

source: Chapter 13.
es: Capítulo 13.

source: Information may be passed to functions via the argument list, which is a comma-delimited list of variables and / or constants.
es: La información puede suministrarse a las funciones mediante la lista de parámetros, una lista de variables y / o constantes separadas por comas.

source: PHP supports passing arguments by value (the default), passing by reference, and default argument values.
es: PHP soporta pasar parámetros por valor (el comportamiento por defecto), por referencia, y parámetros por defecto.

source: Variable-length argument lists are supported only in PHP 4 and later; see Variable-length argument lists and the function references for func_num_args(), func_get_arg(), and func_get_args() for more information.
es: Un efecto similar puede conseguirse en PHP3 pasando un array de parámetros a la función:

source: function takes_array( $input) {echo "$input[0] + $input[1] = ", $input[0]+$input[1];}
es: Por defecto, los parámetros de una función se pasan por valor (de manera que si cambias el valor del argumento dentro de la función, no se ve modificado fuera de ella).

source: By default, function arguments are passed by value (so that if you change the value of the argument within the function, it does not get changed outside of the function).
es: Si quieres que un parámetro de una función siempre se pase por referencia, puedes anteponer un ampersand () al nombre del parámetro en la definición de la función:

source: If you wish to allow a function to modify its arguments, you must pass them by reference.
es: function add_some_extra( $string) {$string .= 'y algo más .';} $str = 'Esto es una cadena,'; add_some_extra($str); echo $str; / / Saca 'Esto es una cadena, y algo más. '

source: If you want an argument to a function to always be passed by reference, you can prepend an ampersand () to the argument name in the function definition:
es: Si deseas pasar una variable por referencia a una función que no toma el parámetro por referencia por defecto, puedes anteponer un ampersand al nombre del parámetro en la llamada a la función:

source: function add_some_extra( $string) {$string .= 'and something extra .';} $str = 'This is a string, '; add_some_extra($str); echo $str; / / outputs'This is a string, and something extra.'
es: function foo ($bar) {$bar .= 'y algo más .';} $str = 'Esto es una cadena,'; foo ($str); echo $str; / / Saca 'Esto es una cadena, 'foo ($str); echo $str; / / Saca 'Esto es una cadena, y algo más.'

source: A function may define C++-style default values for scalar arguments as follows:
es: Una función puede definir valores por defecto para los parámetros escalares estilo C++:

source: function makecoffee ($type = "cappuccino") {return "Making a cup of $type.\n";} echo makecoffee (); echo makecoffee ("espresso");
es: function makecoffee ($type = "cappucino") {return "Hacer una taza de $type.\n";} echo makecoffee (); echo makecoffee ("espresso");

source: The output from the above snippet is:
es: La salida del fragmento anterior es:

source: Making a cup of cappuccino.
es: Hacer una taza de cappucino.

source: Making a cup of espresso.
es: Hacer una taza de espresso.

source: The default value must be a constant expression, not (for example) a variable or class member.
es: En PHP 4.0 también es posible especificar unset como parámetro por defecto.

source: Note that when using default arguments, any defaults should be on the right side of any non-default arguments; otherwise, things will not work as expected.
es: Destacar que cuando se usan parámetros por defecto, estos tienen que estar a la derecha de cualquier parámetro sin valor por defecto; de otra manera las cosas no funcionarán de la forma esperada.

source: Consider the following code snippet:
es: Considera el siguiente fragmento de código:

source: function makeyogurt ($type = "acidophilus", $flavour) {return "Making a bowl of $type $flavour.\n";} echo makeyogurt ("raspberry"); / / won't work as expected
es: function makeyogurt ($type = "acidophilus", $flavour) {return "Haciendo un bol de $type $flavour.\n";} echo makeyogurt ("mora"); / / No funcionará de la manera esperada

source: The output of the above example is:
es: La salida del ejemplo anterior es:

source: Missing argument 2 in call to makeyogurt() in / usr / local / etc / httpd / htdocs / php3test / functest.html on line 41 Making a bowl of raspberry.
es: Missing argument 2 in call to makeyogurt() in / usr / local / etc / httpd / htdocs / php3test / functest.html on line 41 Haciendo un bol de mora.

source: Now, compare the above with this:
es: Y ahora, compáralo con:

source: function makeyogurt ($flavour, $type = "acidophilus") {return "Making a bowl of $type $flavour.\n";} echo makeyogurt ("raspberry"); / / works as expected
es: function makeyogurt ($flavour, $type = "acidophilus") {return "Haciendo un bol de $type $flavour.\n";} echo makeyogurt ("mora"); / / funciona como se esperaba

source: The output of this example is:
es: La salida de este ejemplo es:

source: Making a bowl of acidophilus raspberry.
es: Haciendo un bol de acidophilus mora.

source: PHP 4 has support for variable-length argument lists in user-defined functions.
es: PHP4 soporta las listas de longitud variable de parámetros en las funciones definidas por el usuario.

source: This is really quite easy, using the func_num_args(), func_get_arg(), and func_get_args() functions.
es: Es realmente fácil, usando las funciones func_num_args(), func_get_arg(), y func_get_args().

source: No special syntax is required, and argument lists may still be explicitly provided with function definitions and will behave as normal.
es: No necesita de ninguna sintaxis especial, y las listas de parámetros pueden ser escritas en la llamada a la función y se comportarán de la manera esperada.

source: Returning values
es: Devolver valores

source: sem_acquire() blocks (if necessary) until the semaphore can be acquired.
es: sem_acquire() Produce un bloqueo (de ser necesario) hasta que el semáforo puede adquirirse.

source: A process attempting to acquire a semaphore which it has already acquired will block forever if acquiring the semaphore would cause its max_acquire value to be exceeded.
es: Un proceso intentando adquirir un semáforo ya adquirido, se bloqueará permanentemente si adquiriendo el semáforo, excede su valor de max_acquire.

source: After processing a request, any semaphores acquired by the process but not explicitly released will be released automatically and a warning will be generated.
es: Despues de procesar una petición, cualquier semáforo adquirido por un proceso, que no sea explícitamente liberado, será liberado automñaticamente, generando un mensaje de alerta.

source: See also: sem_get() and sem_release().
es: Véase tambien: sem_get() and sem_release().

source: A positive semaphore identifier on success, or FALSE on error.
es: Un identificador positivo de semáforo en caso de éxito, o falso en caso de error.

source: sem_get() returns an id that can be used to access the System V semaphore with the given key.
es: sem_get() Devuelve un id que puede usarse para acceder al semáforo de System V con la llave dada.

source: The semaphore is created if necessary using the permission bits specified in perm (defaults to 0666).
es: El semáforo se usa si es necesario usando los bits de permisos especificados en perm (por defecto 0666).

source: The number of processes that can acquire the semaphore simultaneously is set to max_acquire (defaults to 1).
es: El número de procesos que pueden adquirir el semáforo simultáneamente, se define en max_acquire (por defecto es 1).

source: Actually this value is set only if the process finds it is the only process currently attached to the semaphore.
es: Actualmente este valor se fija sólo si el proceso determina que es el único relacionado actualmente al semáforo.

source: See also: sem_acquire(), sem_release() and ftok().
es: Una segunda llamada a sem_get() para la misma llave, devolverá un id de semáforo diferente, pero con ambos identificadoes, se accederá al mismo semáforo.

source: This function does not work on Windows systems.
es: Véase también: sem_acquire() y sem_release().

source: To make the serialized string into a PHP value again, use unserialize(). serialize() handles all types, except the resource -type.
es: To make the serialized string into a PHP value again, use unserialize(). serialize() To make the serialized string into a PHP value again, use unserialize(). serialize() handles all types, except the resource-type.

source: Example 1. serialize() example
es: Ejemplo 1. serialize() example

source: The connection is always "persistent" in the sense that only the very first invocation will actually load the driver from the configured SESAM OML PLAM library.
es: The connection is always "persistant" in the sense that only the very first invocation will actually load the driver from the configured SESAM OML PLAM library.

source: float
es: "double"

source: Session handling functions
es: Funciones para el manejo de sesiones

source: session_cache_expire() returns the current setting of session.cache_expire from php.ini.
es: session_cache_expire() devuelve la caducidad actual del caché.

source: Also see the session.cache_expire configuration directive.
es: Si se proporciona nueva_caducidad_cache, se reemplazará la caducidad actual con nueva_caducidad_cache.

source: session_cache_limiter() returns the name of the current cache limiter.
es: session_cache_limiter() devuelve el nombre del limitador de caché actual.

source: If cache_limiter is specified, the name of the current cache limiter is changed to the new value.
es: Si se especifica limitador_del_cache, el nombre del limitador de caché actual se cambia al nuevo valor.

source: The cache limiter defines which cache control HTTP headers are sent to the client.
es: El limitador de caché controla las cabeceras HTTP de control del caché enviadas al cliente.

source: These headers determine the rules by which the page content may be cached by the client and intermediate proxies.
es: Estas cabeceras determinan las reglas por las que el contenido de la página puede ser guardado en el caché local del cliente.

source: Setting the cache limiter to nocache disallows any client / proxy caching.
es: Cambiando el limitador de caché a nocache, por ejemplo, impedirá cualquier tipo de almacenamiento en el caché por parte del cliente.

source: A value of public permits caching by proxies and the client, whereas private disallows caching by proxies and permits the client to cache the contents.
es: Tambié se puede cambiar a private, que es un poco más restrictivo que el public.

source: In private mode, the Expire header sent to the client may cause confusion for some browsers, including Mozilla.
es: En el modo private, la cabecera Expire (caducidad) enviada al cliente puede confundir a algunos navegadores incluyendo Mozilla.

source: You can avoid this problem by using private_no_expire mode.
es: Puede evitar este problema con el modo private_no_expire.

source: The expire header is never sent to the client in this mode.
es: La cabecera Expire nunca se envía al cliente en este modo.

source: The cache limiter is reset to the default value stored in session.cache_limiter at request startup time.
es: Al comenzar la ejecución del script, el limitador de caché se reestablece al valor por defecto guardado en session.cache_limiter.

source: Thus, you need to call session_cache_limiter() for every request (and before session_start() is called).
es: De este modo, es necesario llamar a session_cache_limiter() en cada petición (y antes de llamar a session_start()).

source: Example 1. session_cache_limiter() example
es: Ejemplos con session_cache_limiter()

source: Also see the session.cache_limiter configuration directive.
es: ?php # cambia el limitador del cach eacute; a 'private 'session_cache_limiter('private'); $cache_limiter = session_cache_limiter(); echo "El limitador de cach eacute; est aacute; puesto ahora en $cache_limiter p ";?

source: Voir aussi session_encode()
es: session_decode() decodifica los datos de una sesión que se encuentran en datos, creando las variables guardadas en la sesión.

source: session_destroy() destroys all of the data associated with the current session.
es: session_destroy() destruye todos los datos asociados con la sesión actual.

source: It does not unset any of the global variables associated with the session, or unset the session cookie.
es: No destruye ninguna de las variables globales asociadas a la sesión ni la cookie.

source: This function returns TRUE on success and FALSE on failure to destroy the session data.
es: Esta función devuelve TRUE si se ha destruido la sesión correctamente y FALSE si ha habido algún problema al intentarlo.

source: Destroying a session
es: Destrucción de una sesión

source: ?php / / Initialize the session. / / If you are using session_name( "something"), don't forget it now! session_start(); / / Unset all of the session variables. session_unset(); / / Finally, destroy the session. session_destroy();?
es: ?php / / Inicializa de la sesi oacute; n. / / Si est aacute; usando session_name("algo"), iexcl;no lo olvide ahora! session_start(); / / Destruye todas las variables de la sesi oacute;n session_unset(); / / Finalmente, destruye la sesi oacute;n session_destroy();?

source: Destroying a session with $_SESSION
es: Destrucción de una sesión con $_SESSION

source: ?php / / Initialize the session. / / If you are using session_name( "something"), don't forget it now! session_start(); / / Unset all of the session variables. $_SESSION = array(); / / Finally, destroy the session. session_destroy();?
es: ?php / / Inicializa la sesi oacute; n. / / Si est aacute; usando session_name("algo"), iexcl;no lo olvide ahora! session_start(); / / Destruye todas las variables de la sesi oacute;n $_SESSION = array(); / / Finalmente, destruye la sesi oacute;n session_destroy();?

source: See also session_decode()
es: session_encode() devuelve una cadena con el contenido de la sesión actual en su interior.

source: "lifetime" - The lifetime of the cookie.
es: La función session_get_cookie_params() devuelve un vector con información sobre la cookie de la sesión actual, conteniendo los siguientes elementos:

source: "path" - The path where information is stored.
es: "lifetime" - La duración de la cookie.

source: "domain" - The domain of the cookie.
es: "path" - La ruta donde se guarda la información.

source: "secure" - The cookie should only be sent over secure connections. (This item was added in PHP 4.0.4.)
es: "domain" - El dominio de la cookie.

source: See also the configuration directives session.cookie_lifetime, session.cookie_path, session.cookie_domain, session.cookie_secure, and session_set_cookie_params().
es: "secure" - La cookie debe ser enviada sólo bajo conexiones seguras. (Este elemento fue añadido en PHP 4.0.4.)

source: If id is specified, it will replace the current session id. session_id() needs to be called before session_start() for that purpose.
es: session_id() devuelve el session id de la sesión actual.

source: For example, the file session handler only allows characters in the range a-z, A-Z and 0-9!
es: Si se especifica un id, reemplazará el session id actual.

source: Note that SID is only defined if the client didn 't send the right cookie.
es: También se puede utilizar la constante SID para recuperar el nombre y el session id de la sesión actual como una cadena adecuada para añadir a las URLs.

source: session_is_registered() returns TRUE if there is a global variable with the name name registered in the current session.
es: session_is_registered() devuelve TRUE si hay una variable registrada en la sesión actual cuyo nombre es nombre.

source: If $_SESSION (or $HTTP_SESSION_VARS for PHP 4.0.6 or less) is used, use isset() to check a variable is registered in $_SESSION.
es: Si utiliza $_SESSION (o $HTTP_SESSION_VARS con PHP 4.0.6 o inferior), use isset() para comprobar si una variable está registrada en $_SESSION.

source: If you are using $_SESSION (or $HTTP_SESSION_VARS), do not use session_register(), session_is_registered() and session_unregister().
es: Si utiliza $HTTP_SESSION_VARS / $_SESSION, no use session_register(), session_is_registered() ni session_unregister().

source: session_module_name() returns the name of the current session module.
es: session_module_name() devuelve el nombre del módulo de la sesión actual.

source: If module is specified, that module will be used instead.
es: Si se especifica módulo, se usará ese módulo en su lugar.

source: session_name() returns the name of the current session.
es: session_name() devuelve el nombre de la sesión actual.

source: If name is specified, the name of the current session is changed to its value.
es: Si se especifica un nombre, el nombre de de la sesión actual se cambia a este valor.

source: The session name references the session id in cookies and URLs.
es: El nombre de la sesión hace referencia al session id utilizado en las cookies y en las URLs.

source: It should contain only alphanumeric characters; it should be short and descriptive (i.e. for users with enabled cookie warnings).
es: Debería contener únicamente caracteres alfanuméricos; también debería ser corto y descriptivo (p.ej. para usuarios con los avisos de las cookies activados).

source: The session name is reset to the default value stored in session.name at request startup time.
es: El nombre de la sesión se restaura al valor guardado por defecto en session.name al comenzar la petición.

source: Thus, you need to call session_name() for every request (and before session_start() or session_register() are called).
es: Así, pues, es necesario llamar a session_name() en cada petición (y antes de llamar a session_start() o a session_register()).

source: Example 1. session_name() examples
es: Ejemplo 1.

source: See also the session.name configuration directive.
es: ?php / / Cambiar el nombre de la sesi oacute; n a WebsiteID $nombre_anterior = session_name("WebsiteID"); echo "El anterior nombre de la sesi oacute;n era $nombre_anterior p ";?

source: Read in session data without locking the session data.
es: Lee los datos de una sesión sin bloquearlos.

source: Changing session data is not possible, but frameset performance will be improved.
es: No es posible cambiar los datos de la sesión, pero el rendimiento de los framesets mejorará.

source: session_save_path() returns the path of the current directory used to save session data.
es: session_save_path() devuelve la ruta del directorio usado actualmente para guardar los datos de la sesión.

source: If path is specified, the path to which data is saved will be changed. session_save_path() needs to be called before session_start() for that purpose.
es: Si se especifica path, se cambiará la ruta donde se guardan los datos.

source: For example, on Linux, reiserfs may provide better performance than ext2fs.
es: En algunos sistemas operativos, puede que quiera especificar una ruta en un sistema de ficheros que maneja muchos ficheros pequeños de forma eficiente.

source: See also the session.save_path configuration directive.
es: Por ejemplo, en Linux, reiserfs puede dar un rendimiento mejor que ext2fs.

source: The effect of this function only lasts for the duration of the script.
es: Cambia los parámetros de la cookie definidos en el archivo php.ini.

source: The secure parameter was added in PHP 4.0.4.
es: El efecto de esta función sólo dura hasta que termina el script.

source: See also the configuration directives session.cookie_lifetime, session.cookie_path, session.cookie_domain, session.cookie_secure, and session_get_cookie_params().
es: El parámetro segura fue añadido en PHP 4.0.4.

source: session_set_save_handler() sets the user-level session storage functions which are used for storing and retrieving data associated with a session.
es: session_set_save_handler() session_set_save_handler() establece las funciones que se utilizan a nivel de usuario para el almacenamiento y recuperación de los datos asociados a una sesión.

source: This is most useful when a storage method other than those supplied by PHP sessions is preferred. i.e.
es: Es lo más útil cuando se prefiere utilizar otro método de almacenamiento distinto del proporcionaddo por las sesiones de PHP. p.ej.

source: Storing the session data in a local database.
es: Almacenar los datos de la sesión en una base de datos local.

source: The "write" handler is not executed until after the output stream is closed.
es: Debe cambiar la opción session.save_handler en la configuración a user en su archivo php.ini para que session_set_save_handler() tenga efecto.

source: Thus, output from debugging statements in the "write" handler will never be seen in the browser.
es: El manejador "escribir" no se ejecuta hasta que se cierra la salida.

source: The write handler is not executed if the session contains no data; this applies even if empty session variables are registered.
es: Si se necesita producir una salida para el depurado, se sugiere que la salida se produzca en un archivo.

source: This differs to the default file-based session save handler, which creates empty session files.
es: El siguiente ejemplo proporciona almacenamiento de las sesiones basado en archivos de forma similar al manejador de sesiones por defecto de PHP files.

source: The following example provides file based session storage similar to the PHP sessions default save handler files.
es: Este ejemplo puede ser extendido fácilmente para cubrir el almacenamiento en bases de datos usando su motor de soporte de bases de datos de PHP favorito.

source: This example could easily be extended to cover database storage using your favorite PHP supported database engine.
es: La función de lectura debe devolver siempre una cadena para que el manejador de escritura funcione como se espera.

source: Read function must return string value always to make save handler work as expected.
es: Devuelva una cadena vacía si no hay ningún dato a leer.

source: Return empty string if there is no data to read.
es: Los valores devueltos de otros manejadores son convertidos a una expresión booleana.

source: Return values from other handlers are converted to boolean expression.
es: TRUE si todo ha ido correctamente, FALSE si ha habido algún problema.

source: TRUE for success, FALSE for failure.
es: Ejemplo 1.
